[M_Ep15_CharacterAssassination MissionDefinition]
MissionDescription="Mordecai has determined that if you can find where the Warrior is buried, you will find Jack. Now that you've helped the Slabs grab some explosives from [place]Sawtooth Cauldron[-place], you're ready to blast your way into the [place]Hyperion Info Stockade[-place] and get the info you need."
TurnInDescription="No more planning. No more distractions. It's time to end this."

[M_Ep15_CharacterAssassination:CrankPressure MissionObjectiveDefinition]
ProgressMessage="Overload first pump station"

[M_Ep15_CharacterAssassination:FindEvidence1 MissionObjectiveDefinition]
ProgressMessage="Access first terminal"

[M_Ep15_CharacterAssassination:FindEvidence2 MissionObjectiveDefinition]
ProgressMessage="Access second terminal"

[M_Ep15_CharacterAssassination:GettoPipeLineSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai has determined that if you can find where the Warrior is buried, you will find Jack. The [place]Hyperion Info Stockade[-place] has the info you need. You've increased the pressure to the Stockade's Eridium pipeline. Now, for the fun part -- if you can hit the pipeline with a vehicle, Mordecai says, it will pop open like a blister and allow you access to the Stockade."

[M_Ep15_CharacterAssassination:GoToArchiveBuildingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai has determined that if you can find where the Warrior is buried, you will find Jack. The [place]Hyperion Info Stockade[-place] has the info you need. With the Eridium pipe destroyed, the path into the stockade is clear. Mordecai has asked you to get inside and find out where the Warrior is buried."

[M_Ep15_CharacterAssassination:GoToPumpingStationSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Mordecai has determined that if you can find where the Warrior is buried, you will find Jack. The [place]Hyperion Info Stockade[-place] has the info you need. To get into the Stockade, Mordecai wants you to increase the pressure of the Eridium pipeline leading to it. The pipe will burst, and you'll be able to enter the Stockade through the big ol' hole left by the explosion."

[M_Ep15_CharacterAssassination:PumpStation2ValveCranked MissionObjectiveDefinition]
ProgressMessage="Overload second pump station"

[M_Ep15_CharacterAssassination:PumpStation3ValveCranked MissionObjectiveDefinition]
ProgressMessage="Overload third pump station"

[M_Ep15_CharacterAssassination:ReturntoClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="No more planning. No more distractions. It's time to end this."
